injector2degHex/case_interFoam_3mm/0.orig/p_rgh
<<<<<<< HEAD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField // https://www.openfoam.com/documentation/user-guide/standard-boundaryconditions.php
{
    inlet
    {
        type            fixedValue;
        value           uniform 45e5;
	// type            prghTotalPressure;
    //     p0           	uniform 2000000;
	// value		uniform 2000000;   
    }
    outlet
    {	
	    type            fixedValue;
    	value		    uniform 35e5;
    }
    walls
    {
        type            fixedFluxPressure;
    }
    side1
    {
        type            cyclic;
        neighbourPatch  side2;
    }
    side2
    {
        type            cyclic;
        neighbourPatch  side1;
    }
}

// ************************************************************************* //
=======
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0; //gauge pressure - possible as using incompressable solver

<<<<<<< HEAD:injector2degHex/case_interPhaseChangeFoam/processor2/0/p_rgh
internalField   uniform 4.5e+06;

boundaryField
=======
boundaryField //LP: https://www.openfoam.com/documentation/user-guide/standard-boundaryconditions.php
>>>>>>> baef0c4ff826b6b946fed9c15dc59c41c22ef7f6:injector2degHex/case_interFoam/0.orig/p_rgh
{
    inlet
    {
        type            fixedValue;
<<<<<<< HEAD:injector2degHex/case_interPhaseChangeFoam/processor2/0/p_rgh
        value           uniform 4.5e+06;
=======
        value           uniform 2e5;
	// type            prghTotalPressure;
    //     p0           	uniform 2000000;
	// value		uniform 2000000;
        
>>>>>>> baef0c4ff826b6b946fed9c15dc59c41c22ef7f6:injector2degHex/case_interFoam/0.orig/p_rgh
    }

    outlet
<<<<<<< HEAD:injector2degHex/case_interPhaseChangeFoam/processor2/0/p_rgh
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
=======
    {	
	    type            fixedValue;
    	value		    uniform 0;
>>>>>>> baef0c4ff826b6b946fed9c15dc59c41c22ef7f6:injector2degHex/case_interFoam/0.orig/p_rgh
    }

    walls
    {
        type            fixedFluxPressure;
<<<<<<< HEAD:injector2degHex/case_interPhaseChangeFoam/processor2/0/p_rgh
        gradient        uniform 0;
        value           uniform 4.5e+06;
    }
    side1
    {
        type            cyclic;
    }
    side2
    {
        type            cyclic;
    }
    procBoundary2to1
    {
        type            processor;
        value           uniform 4.5e+06;
=======
    }

    sides
    {
        type            symmetry; //LP: pretty sure this should be "cyclic" https://www.openfoam.com/documentation/guides/latest/doc/guide-bcs-coupled-cyclic.html 
>>>>>>> baef0c4ff826b6b946fed9c15dc59c41c22ef7f6:injector2degHex/case_interFoam/0.orig/p_rgh
    }
}

// ************************************************************************* //
>>>>>>> baef0c4ff826b6b946fed9c15dc59c41c22ef7f6
