injector2degHex/case_interFoam_3mm/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water vapour);

sigma           3.6714e-03; // nitrous surface tension @ 10 C original: 0.07;

water //nitrous properties at 10 C 
{
    transportModel  Newtonian;
    nu              7.8391e-5;//original //
    rho             8.5217e2;//original //
}

vapour //nitrous properties at 10 C 
{
    transportModel  Newtonian;
    nu              1.4163e-1;//original: //
    rho             1.1491e2;//original: //
    // nu              4.273e-4;
    // rho             0.02308;
}


// ************************************************************************* //
