injector2degHex/case_interFoam_3mm/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime; //used to be endTime, writeNow for emergency stop

endTime         1;//was 3ms

deltaT          1e-5;//1e-5;

writeControl    adjustable;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           2; 

maxAlphaCo      2;

maxDeltaT       1;

// perhaps use eddie's custom restriction block in matlab to predict the maximum velocity (if we get to considering compressibility)
// and find what our mesh size should be for ideal courant number from that?


// ************************************************************************* //
